"""
1.简单行列索引
2.列表索引
3.布尔索引
4多维索引
以上返回的是张量视图
5.Tensor.data返回的是张量的视图
"""
import torch
import numpy as np
torch.manual_seed(71910025)
t = torch.randint(1,10,(4,5))
print(f"t = {t}")
print('-' * 50)
""" t = 
[[2, 4, 6, 5, 6],
[9, 8, 5, 5, 7],
[6, 7, 8, 5, 5],
[4, 6, 8, 4, 2]]
"""
#场景一->简单切片索引
print(t[0])
print(t[0,:])
print(t[1,1])
print(t[1:3:2,2:3])#返回的是二维张量，因为切片的目标提取中维度是被范围提取的会被保留下来
print('-' * 50)
#场景二->列表索引
print(t[[1,2],[3,4]])#表示返回第一，二行的第三，四列
print(t[[1,2],:])
print('-' * 50)
#场景三->布尔索引
print(t[1,t[1]>5])#找到第一行大于5的元素，注意，t[1]>5其实返回的是在t[1]切片中大于5的索引
print('-' * 50)
#场景四->多维切片
arr = np.array([t.numpy(),t.numpy()])
t = torch.from_numpy(arr)
print(f"t = {t}")
print('-' * 50)
"""
[[[2, 4, 6, 5, 6],
  [9, 8, 5, 5, 7],
  [6, 7, 8, 5, 5],
  [4, 6, 8, 4, 2]],

  [[2, 4, 6, 5, 6],
   [9, 8, 5, 5, 7],
   [6, 7, 8, 5, 5],
   [4, 6, 8, 4, 2]]]
"""
print(t[:,0,:])
print(t[:,:,0])